InformationRegisters/ЛБ_ПриказыВОперацияхЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПриказыВОперацияхЗайма</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказУсловияПредоставленияЗаймов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказИндивидуальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтклонениеПоАкции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидПриказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПриказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Установить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_УстановитьВПриказе</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_УстановитьВПриказе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_УстановитьВПриказе</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Металлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЛБ_ПриказыВОперацияхЗайма/Forms/ФормаПросмотра/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
		Если Параметры.Свойство("Установить") Тогда  
			Установить = Параметры.Установить; 
		КонецЕсли;	 
	    Список.Параметры.УстановитьЗначениеПараметра("ЗалоговыйБилет", ЗалоговыйБилет);
		Список.Параметры.УстановитьЗначениеПараметра("Установить", Установить);
		
		Если Установить = Перечисления.ЛБ_УстановитьВПриказе.Ставки Тогда
			ТекстУстановить  = "приказы по % ставкам"; 
		ИначеЕсли Установить = Перечисления.ЛБ_УстановитьВПриказе.Металлы Тогда
			ТекстУстановить  = "приказы по ценам металлов";
		ИначеЕсли Установить = Перечисления.ЛБ_УстановитьВПриказе.Вставки Тогда
			ТекстУстановить  = "приказы по ценам драг. вставок";	
	    КонецЕсли;
		ЭтаФорма.Заголовок  = "ЗБ № " + СокрЛП(ЗалоговыйБилет.НомерЗалоговогоБилета)+ ": " + ТекстУстановить;
	Иначе	
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
